In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
myData = {'me':[3,5,np.NaN], 'mf':[4,np.NaN,np.NaN], 'mof':[3,5,4] }

In [4]:
myDataFrame = pd.DataFrame(myData)

In [5]:
myDataFrame

    me   mf  mof
0  3.0  4.0    3
1  5.0  NaN    5
2  NaN  NaN    4

In [6]:
myDataFrame.dropna()

    me   mf  mof
0  3.0  4.0    3

In [7]:
myDataFrame.fillna(value = 'lco')

    me   mf  mof
0    3    4    3
1    5  lco    5
2  lco  lco    4

In [8]:
myDataFrame.fillna(value = myDataFrame['me'].mean(),inplace = True)

In [9]:
myDataFrame

    me   mf  mof
0  3.0  4.0    3
1  5.0  4.0    5
2  4.0  4.0    4

In [10]:
newData = {
    'Movies' : ['Star-Wars','Star-Wars','Batman','Batman','Deadpool','Deadpool'],
    'Viewers' : ['Me', 'MF', 'MOF', 'Bobby', 'Dean', 'Sammy'],
    'Ratings' : [10,7,6,9,8,5]
}

In [11]:
newData

{'Movies': ['Star-Wars',
  'Star-Wars',
  'Batman',
  'Batman',
  'Deadpool',
  'Deadpool'],
 'Ratings': [10, 7, 6, 9, 8, 5],
 'Viewers': ['Me', 'MF', 'MOF', 'Bobby', 'Dean', 'Sammy']}

In [12]:
movieFrame = pd.DataFrame(newData)

In [13]:
movieFrame

      Movies  Ratings Viewers
0  Star-Wars       10      Me
1  Star-Wars        7      MF
2     Batman        6     MOF
3     Batman        9   Bobby
4   Deadpool        8    Dean
5   Deadpool        5   Sammy

In [14]:
movieFrame.groupby('Movies').mean()

           Ratings
Movies
Batman         7.5
Deadpool       6.5
Star-Wars      8.5

In [15]:
movieFrame.groupby('Movies').std().loc['Deadpool']

Ratings    2.12132
Name: Deadpool, dtype: float64

In [16]:
movieFrame.groupby('Movies').std().iloc[2]

Ratings    2.12132
Name: Star-Wars, dtype: float64

In [17]:
movieFrame.groupby('Movies').describe()

          Ratings
            count mean      std  min   25%  50%   75%   max
Movies
Batman        2.0  7.5  2.12132  6.0  6.75  7.5  8.25   9.0
Deadpool      2.0  6.5  2.12132  5.0  5.75  6.5  7.25   8.0
Star-Wars     2.0  8.5  2.12132  7.0  7.75  8.5  9.25  10.0